#+TITLE: ZSH Configuration Bootstrap
#+AUTHOR: Jeff Farr
#+DATE: 2026-01-10
#+PROPERTY: header-args:sh :results output :exports both

** Hostname and OS Information

#+begin_src sh
echo "Hostname: $(hostname)"
echo "OS: $(uname -s)"
echo "OS Version: $(sw_vers -productVersion 2>/dev/null || uname -r)"
echo "Architecture: $(uname -m)"
echo "Shell: $SHELL"
echo "ZSH Version: $(zsh --version)"
#+end_src

#+RESULTS:
: Hostname: Mac.home
: OS: Darwin
: OS Version: 26.1
: Architecture: arm64
: Shell: /bin/zsh
: ZSH Version: zsh 5.9 (arm64-apple-darwin25.0)

** Check Existing Installations

#+begin_src sh
echo "=== Antidote ==="
if [[ -d ~/.antidote ]]; then
    echo "✓ Antidote installed at: ~/.antidote"
    cd ~/.antidote && git log -1 --format="  Commit: %h - %s (%ci)" 2>/dev/null
else
    echo "✗ Antidote not installed"
fi

echo ""
echo "=== Oh My Zsh ==="
if [[ -d ~/.oh-my-zsh ]]; then
    echo "✓ Oh My Zsh installed at: ~/.oh-my-zsh"
    cd ~/.oh-my-zsh && git log -1 --format="  Commit: %h - %s (%ci)" 2>/dev/null
else
    echo "✗ Oh My Zsh not installed"
fi

echo ""
echo "=== FZF ==="
if command -v fzf &> /dev/null; then
    echo "✓ FZF installed: $(fzf --version)"
    echo "  Location: $(which fzf)"
else
    echo "✗ FZF not installed"
fi

echo ""
echo "=== Homebrew FZF ==="
if [[ -d /opt/homebrew/opt/fzf ]]; then
    echo "✓ Homebrew FZF at: /opt/homebrew/opt/fzf"
elif [[ -d /usr/local/opt/fzf ]]; then
    echo "✓ Homebrew FZF at: /usr/local/opt/fzf"
else
    echo "✗ Homebrew FZF not found"
fi

echo ""
echo "=== zsh-histdb ==="
if [[ -d ~/.oh-my-zsh/custom/plugins/zsh-histdb ]]; then
    echo "✓ zsh-histdb installed"
    cd ~/.oh-my-zsh/custom/plugins/zsh-histdb && git log -1 --format="  Commit: %h - %s (%ci)" 2>/dev/null
else
    echo "✗ zsh-histdb not installed"
fi
#+end_src

#+RESULTS:
#+begin_example
=== Antidote ===
✓ Antidote installed at: ~/.antidote
  Commit: 9e09a74 - Merge pull request #232 from mattmc3/v1.9.11 (2025-12-12 19:26:54 -0500)

=== Oh My Zsh ===
✓ Oh My Zsh installed at: ~/.oh-my-zsh
  Commit: 871d4b9 - fix(1password)!: remove v1 support (#13507) (2026-01-08 12:02:40 +0100)

=== FZF ===
✓ FZF installed: 0.67.0 (Homebrew)
  Location: /opt/homebrew/bin/fzf

=== Homebrew FZF ===
✓ Homebrew FZF at: /opt/homebrew/opt/fzf

=== zsh-histdb ===
✓ zsh-histdb installed
  Commit: 90a6c10 - Merge pull request #122 from ericbn/history_ignore (2024-04-18 19:02:18 +0100)
#+end_example

** Check Dotfiles Symlinks

#+begin_src sh
echo "=== Critical Symlinks ==="
for link in ~/.zshrc ~/.zsh_plugins.txt ~/.p10k.zsh ~/.fzf.zsh; do
    if [[ -L "$link" ]]; then
        target=$(readlink "$link")
        echo "✓ $link -> $target"
    else
        echo "✗ $link not symlinked"
    fi
done
#+end_src

#+RESULTS:
: === Critical Symlinks ===
: ✓ /Users/jefffarr/.zshrc -> /Users/jefffarr/src/dotfiles/zshrc
: ✓ /Users/jefffarr/.zsh_plugins.txt -> /Users/jefffarr/src/dotfiles/.zsh_plugins.txt
: ✓ /Users/jefffarr/.p10k.zsh -> /Users/jefffarr/src/dotfiles/p10k.zsh
: ✓ /Users/jefffarr/.fzf.zsh -> /Users/jefffarr/src/dotfiles/fzf.zsh

** Check Antidote Plugins

#+begin_src sh
if [[ -f ~/.zsh_plugins.txt ]]; then
    echo "=== Configured Plugins (from .zsh_plugins.txt) ==="
    cat ~/.zsh_plugins.txt | grep -v '^#' | grep -v '^$'

    echo ""
    echo "=== Installed Plugins (in Antidote cache) ==="
    if command -v antidote &> /dev/null 2>&1 || [[ -f ~/.antidote/antidote.zsh ]]; then
        source ~/.antidote/antidote.zsh 2>/dev/null
        antidote list 2>/dev/null || echo "Run 'source ~/.zshrc' first to initialize plugins"
    else
        echo "Antidote not available"
    fi
else
    echo "✗ .zsh_plugins.txt not found"
fi
#+end_src

#+RESULTS:
#+begin_example
=== Configured Plugins (from .zsh_plugins.txt) ===
romkatv/powerlevel10k kind:fpath
zsh-users/zsh-autosuggestions
zsh-users/zsh-syntax-highlighting
ohmyzsh/ohmyzsh path:lib
ohmyzsh/ohmyzsh path:plugins/git
ohmyzsh/ohmyzsh path:plugins/macos
ohmyzsh/ohmyzsh path:plugins/docker
ohmyzsh/ohmyzsh path:plugins/fzf
Aloxaf/fzf-tab

=== Installed Plugins (in Antidote cache) ===
Run 'source ~/.zshrc' first to initialize plugins
#+end_example

